MikroElektronika/core_packages/RX/gcc/def/renesas/R5F572MNDDFB/mcu.h
#define	MSTP_EXDMAC		SYSTEM.MSTPCRA.BIT.MSTPA29
#define	MSTP_EXDMAC0	SYSTEM.MSTPCRA.BIT.MSTPA29
#define	MSTP_EXDMAC1	SYSTEM.MSTPCRA.BIT.MSTPA29
#define	MSTP_DMAC		SYSTEM.MSTPCRA.BIT.MSTPA28
#define	MSTP_DMAC0		SYSTEM.MSTPCRA.BIT.MSTPA28
#define	MSTP_DMAC1		SYSTEM.MSTPCRA.BIT.MSTPA28
#define	MSTP_DMAC2		SYSTEM.MSTPCRA.BIT.MSTPA28
#define	MSTP_DMAC3		SYSTEM.MSTPCRA.BIT.MSTPA28
#define	MSTP_DMAC4		SYSTEM.MSTPCRA.BIT.MSTPA28
#define	MSTP_DMAC5		SYSTEM.MSTPCRA.BIT.MSTPA28
#define	MSTP_DMAC6		SYSTEM.MSTPCRA.BIT.MSTPA28
#define	MSTP_DMAC7		SYSTEM.MSTPCRA.BIT.MSTPA28
#define	MSTP_DTC		SYSTEM.MSTPCRA.BIT.MSTPA28
#define	MSTP_DA			SYSTEM.MSTPCRA.BIT.MSTPA19
#define	MSTP_S12AD		SYSTEM.MSTPCRA.BIT.MSTPA17
#define	MSTP_S12AD1		SYSTEM.MSTPCRA.BIT.MSTPA16
#define	MSTP_CMT0		SYSTEM.MSTPCRA.BIT.MSTPA15
#define	MSTP_CMT1		SYSTEM.MSTPCRA.BIT.MSTPA15
#define	MSTP_CMT2		SYSTEM.MSTPCRA.BIT.MSTPA14
#define	MSTP_CMT3		SYSTEM.MSTPCRA.BIT.MSTPA14
#define	MSTP_TPU0		SYSTEM.MSTPCRA.BIT.MSTPA13
#define	MSTP_TPU1		SYSTEM.MSTPCRA.BIT.MSTPA13
#define	MSTP_TPU2		SYSTEM.MSTPCRA.BIT.MSTPA13
#define	MSTP_TPU3		SYSTEM.MSTPCRA.BIT.MSTPA13
#define	MSTP_TPU4		SYSTEM.MSTPCRA.BIT.MSTPA13
#define	MSTP_TPU5		SYSTEM.MSTPCRA.BIT.MSTPA13
#define	MSTP_TPUA		SYSTEM.MSTPCRA.BIT.MSTPA13
#define	MSTP_PPG0		SYSTEM.MSTPCRA.BIT.MSTPA11
#define	MSTP_PPG1		SYSTEM.MSTPCRA.BIT.MSTPA10
#define	MSTP_MTU		SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_MTU0		SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_MTU1		SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_MTU2		SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_MTU3		SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_MTU4		SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_MTU5		SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_MTU6		SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_MTU7		SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_MTU8		SYSTEM.MSTPCRA.BIT.MSTPA9
#define	MSTP_GPTW		SYSTEM.MSTPCRA.BIT.MSTPA7
#define	MSTP_GPTW0		SYSTEM.MSTPCRA.BIT.MSTPA7
#define	MSTP_GPTW1		SYSTEM.MSTPCRA.BIT.MSTPA7
#define	MSTP_GPTW2		SYSTEM.MSTPCRA.BIT.MSTPA7
#define	MSTP_GPTW3		SYSTEM.MSTPCRA.BIT.MSTPA7
#define	MSTP_POEG		SYSTEM.MSTPCRA.BIT.MSTPA7
#define	MSTP_TMR0		SYSTEM.MSTPCRA.BIT.MSTPA5
#define	MSTP_TMR1		SYSTEM.MSTPCRA.BIT.MSTPA5
#define	MSTP_TMR01		SYSTEM.MSTPCRA.BIT.MSTPA5
#define	MSTP_TMR2		SYSTEM.MSTPCRA.BIT.MSTPA4
#define	MSTP_TMR3		SYSTEM.MSTPCRA.BIT.MSTPA4
#define	MSTP_TMR23		SYSTEM.MSTPCRA.BIT.MSTPA4
#define	MSTP_CMTW0		SYSTEM.MSTPCRA.BIT.MSTPA1
#define	MSTP_CMTW1		SYSTEM.MSTPCRA.BIT.MSTPA0
#define	MSTP_SCI0		SYSTEM.MSTPCRB.BIT.MSTPB31
#define	MSTP_SMCI0		SYSTEM.MSTPCRB.BIT.MSTPB31
#define	MSTP_SCI1		SYSTEM.MSTPCRB.BIT.MSTPB30
#define	MSTP_SMCI1		SYSTEM.MSTPCRB.BIT.MSTPB30
#define	MSTP_SCI2		SYSTEM.MSTPCRB.BIT.MSTPB29
#define	MSTP_SMCI2		SYSTEM.MSTPCRB.BIT.MSTPB29
#define	MSTP_SCI3		SYSTEM.MSTPCRB.BIT.MSTPB28
#define	MSTP_SMCI3		SYSTEM.MSTPCRB.BIT.MSTPB28
#define	MSTP_SCI4		SYSTEM.MSTPCRB.BIT.MSTPB27
#define	MSTP_SMCI4		SYSTEM.MSTPCRB.BIT.MSTPB27
#define	MSTP_SCI5		SYSTEM.MSTPCRB.BIT.MSTPB26
#define	MSTP_SMCI5		SYSTEM.MSTPCRB.BIT.MSTPB26
#define	MSTP_SCI6		SYSTEM.MSTPCRB.BIT.MSTPB25
#define	MSTP_SMCI6		SYSTEM.MSTPCRB.BIT.MSTPB25
#define	MSTP_SCI7		SYSTEM.MSTPCRB.BIT.MSTPB24
#define	MSTP_SMCI7		SYSTEM.MSTPCRB.BIT.MSTPB24
#define	MSTP_CRC		SYSTEM.MSTPCRB.BIT.MSTPB23
#define	MSTP_PDC		SYSTEM.MSTPCRB.BIT.MSTPB22
#define	MSTP_RIIC0		SYSTEM.MSTPCRB.BIT.MSTPB21
#define	MSTP_RIIC1		SYSTEM.MSTPCRB.BIT.MSTPB20
#define	MSTP_USB0		SYSTEM.MSTPCRB.BIT.MSTPB19
#define	MSTP_RSPI0		SYSTEM.MSTPCRB.BIT.MSTPB17
#define	MSTP_RSPI1		SYSTEM.MSTPCRB.BIT.MSTPB16
#define	MSTP_ETHERC0	SYSTEM.MSTPCRB.BIT.MSTPB15
#define	MSTP_EDMAC0		SYSTEM.MSTPCRB.BIT.MSTPB15
#define	MSTP_PMGI0		SYSTEM.MSTPCRB.BIT.MSTPB15
#define	MSTP_ETHERC1	SYSTEM.MSTPCRB.BIT.MSTPB14
#define	MSTP_EDMAC1		SYSTEM.MSTPCRB.BIT.MSTPB14
#define	MSTP_PMGI1		SYSTEM.MSTPCRB.BIT.MSTPB14
#define	MSTP_EPTPC		SYSTEM.MSTPCRB.BIT.MSTPB13
#define	MSTP_EPTPC0		SYSTEM.MSTPCRB.BIT.MSTPB13
#define	MSTP_EPTPC1		SYSTEM.MSTPCRB.BIT.MSTPB13
#define	MSTP_PTPEDMAC	SYSTEM.MSTPCRB.BIT.MSTPB13
#define	MSTP_DSMIF		SYSTEM.MSTPCRB.BIT.MSTPB11
#define	MSTP_DSMIF0		SYSTEM.MSTPCRB.BIT.MSTPB11
#define	MSTP_DSMIF1		SYSTEM.MSTPCRB.BIT.MSTPB11
#define	MSTP_ELC		SYSTEM.MSTPCRB.BIT.MSTPB9
#define	MSTP_TEMPS		SYSTEM.MSTPCRB.BIT.MSTPB8
#define	MSTP_DOC		SYSTEM.MSTPCRB.BIT.MSTPB6
#define	MSTP_SCI12		SYSTEM.MSTPCRB.BIT.MSTPB4
#define	MSTP_SMCI12		SYSTEM.MSTPCRB.BIT.MSTPB4
#define	MSTP_CAN2		SYSTEM.MSTPCRB.BIT.MSTPB2
#define	MSTP_CAN1		SYSTEM.MSTPCRB.BIT.MSTPB1
#define	MSTP_CAN0		SYSTEM.MSTPCRB.BIT.MSTPB0
#define	MSTP_GLCDC		SYSTEM.MSTPCRC.BIT.MSTPC29
#define	MSTP_DRW2D		SYSTEM.MSTPCRC.BIT.MSTPC28
#define	MSTP_SCI8		SYSTEM.MSTPCRC.BIT.MSTPC27
#define	MSTP_SMCI8		SYSTEM.MSTPCRC.BIT.MSTPC27
#define	MSTP_SCI9		SYSTEM.MSTPCRC.BIT.MSTPC26
#define	MSTP_SMCI9		SYSTEM.MSTPCRC.BIT.MSTPC26
#define	MSTP_SCI10		SYSTEM.MSTPCRC.BIT.MSTPC25
#define	MSTP_SMCI10		SYSTEM.MSTPCRC.BIT.MSTPC25
#define	MSTP_SCI11		SYSTEM.MSTPCRC.BIT.MSTPC24
#define	MSTP_SMCI11		SYSTEM.MSTPCRC.BIT.MSTPC24
#define	MSTP_QSPI		SYSTEM.MSTPCRC.BIT.MSTPC23
#define	MSTP_RSPI2		SYSTEM.MSTPCRC.BIT.MSTPC22
#define	MSTP_CAC		SYSTEM.MSTPCRC.BIT.MSTPC19
#define	MSTP_RIIC2		SYSTEM.MSTPCRC.BIT.MSTPC17
#define	MSTP_STBYRAM	SYSTEM.MSTPCRC.BIT.MSTPC7
#define	MSTP_ECCRAM		SYSTEM.MSTPCRC.BIT.MSTPC6
#define	MSTP_RAM2		SYSTEM.MSTPCRC.BIT.MSTPC2
#define	MSTP_RAM0		SYSTEM.MSTPCRC.BIT.MSTPC0
#define	MSTP_TSIP		SYSTEM.MSTPCRD.BIT.MSTPD27
#define	MSTP_MMCIF		SYSTEM.MSTPCRD.BIT.MSTPD21
#define	MSTP_SDHI		SYSTEM.MSTPCRD.BIT.MSTPD19
#define	MSTP_SSIE0		SYSTEM.MSTPCRD.BIT.MSTPD15
#define	MSTP_SSIE1		SYSTEM.MSTPCRD.BIT.MSTPD14
#define	MSTP_ESC		SYSTEM.MSTPCRD.BIT.MSTPD11

#define	IS_DPFPU_DPFPUEX		IS0
#define	IS_CAN0_ERS0			IS0
#define	IS_CAN1_ERS1			IS1
#define	IS_CAN2_ERS2			IS2
#define	IS_SCI0_TEI0			IS0
#define	IS_SCI0_ERI0			IS1
#define	IS_SCI1_TEI1			IS2
#define	IS_SCI1_ERI1			IS3
#define	IS_SCI2_TEI2			IS4
#define	IS_SCI2_ERI2			IS5
#define	IS_SCI3_TEI3			IS6
#define	IS_SCI3_ERI3			IS7
#define	IS_SCI4_TEI4			IS8
#define	IS_SCI4_ERI4			IS9
#define	IS_SCI5_TEI5			IS10
#define	IS_SCI5_ERI5			IS11
#define	IS_SCI6_TEI6			IS12
#define	IS_SCI6_ERI6			IS13
#define	IS_SCI12_TEI12			IS16
#define	IS_SCI12_ERI12			IS17
#define	IS_SCI12_SCIX0			IS18
#define	IS_SCI12_SCIX1			IS19
#define	IS_SCI12_SCIX2			IS20
#define	IS_SCI12_SCIX3			IS21
#define	IS_QSPI_QSPSSLI			IS24
#define	IS_CAC_FERRI			IS26
#define	IS_CAC_MENDI			IS27
#define	IS_CAC_OVFI				IS28
#define	IS_DOC_DOPCI			IS29
#define	IS_PDC_PCFEI			IS30
#define	IS_PDC_PCERI			IS31
#define	IS_SDHI_CDETI			IS3
#define	IS_SDHI_CACI			IS4
#define	IS_SDHI_SDACI			IS5
#define	IS_MMCIF_CDETIO			IS6
#define	IS_MMCIF_ERRIO			IS7
#define	IS_MMCIF_ACCIO			IS8
#define	IS_POE3_OEI1			IS9
#define	IS_POE3_OEI2			IS10
#define	IS_POE3_OEI3			IS11
#define	IS_POE3_OEI4			IS12
#define	IS_RIIC0_TEI0			IS13
#define	IS_RIIC0_EEI0			IS14
#define	IS_RIIC2_TEI2			IS15
#define	IS_RIIC2_EEI2			IS16
#define	IS_SSIE0_SSIF0			IS17
#define	IS_SSIE1_SSIF1			IS18
#define	IS_S12AD_S12CMPAI		IS20
#define	IS_S12AD_S12CMPBI		IS21
#define	IS_S12AD1_S12CMPAI1		IS22
#define	IS_S12AD1_S12CMPBI1		IS23
#define	IS_RIIC1_TEI1			IS28
#define	IS_RIIC1_EEI1			IS29
#define	IS_DSMIF0_OCDI0			IS1
#define	IS_DSMIF0_SUMEI0		IS2
#define	IS_DSMIF0_SCDI0			IS3
#define	IS_DSMIF1_OCDI1			IS4
#define	IS_DSMIF1_SUMEI1		IS5
#define	IS_DSMIF1_SCDI1			IS6
#define	IS_POEG_POEGGAI			IS7
#define	IS_POEG_POEGGBI			IS8
#define	IS_POEG_POEGGCI			IS9
#define	IS_POEG_POEGGDI			IS10
#define	IS_SCI8_TEI8			IS0
#define	IS_SCI8_ERI8			IS1
#define	IS_SCI9_TEI9			IS4
#define	IS_SCI9_ERI9			IS5
#define	IS_SCI10_TEI10			IS8
#define	IS_SCI10_ERI10			IS9
#define	IS_SCI11_TEI11			IS12
#define	IS_SCI11_ERI11			IS13
#define	IS_RSPI0_SPII0			IS16
#define	IS_RSPI0_SPEI0			IS17
#define	IS_RSPI1_SPII1			IS18
#define	IS_RSPI1_SPEI1			IS19
#define	IS_RSPI2_SPII2			IS20
#define	IS_RSPI2_SPEI2			IS21
#define	IS_SCI7_TEI7			IS22
#define	IS_SCI7_ERI7			IS23
#define	IS_EPTPC_MINT			IS0
#define	IS_PTPEDMAC_PINT		IS1
#define	IS_EDMAC0_EINT0			IS4
#define	IS_EDMAC1_EINT1			IS5
#define	IS_GLCDC_VPOS			IS8
#define	IS_GLCDC_GR1UF			IS9
#define	IS_GLCDC_GR2UF			IS10
#define	IS_DRW2D_DRWIRQ			IS11
#define	IS_ESC_ESCI				IS13

#define	EN_DPFPU_DPFPUEX		EN0
#define	EN_CAN0_ERS0			EN0
#define	EN_CAN1_ERS1			EN1
#define	EN_CAN2_ERS2			EN2
#define	EN_SCI0_TEI0			EN0
#define	EN_SCI0_ERI0			EN1
#define	EN_SCI1_TEI1			EN2
#define	EN_SCI1_ERI1			EN3
#define	EN_SCI2_TEI2			EN4
#define	EN_SCI2_ERI2			EN5
#define	EN_SCI3_TEI3			EN6
#define	EN_SCI3_ERI3			EN7
#define	EN_SCI4_TEI4			EN8
#define	EN_SCI4_ERI4			EN9
#define	EN_SCI5_TEI5			EN10
#define	EN_SCI5_ERI5			EN11
#define	EN_SCI6_TEI6			EN12
#define	EN_SCI6_ERI6			EN13
#define	EN_SCI12_TEI12			EN16
#define	EN_SCI12_ERI12			EN17
#define	EN_SCI12_SCIX0			EN18
#define	EN_SCI12_SCIX1			EN19
#define	EN_SCI12_SCIX2			EN20
#define	EN_SCI12_SCIX3			EN21
#define	EN_QSPI_QSPSSLI			EN24
#define	EN_CAC_FERRI			EN26
#define	EN_CAC_MENDI			EN27
#define	EN_CAC_OVFI				EN28
#define	EN_DOC_DOPCI			EN29
#define	EN_PDC_PCFEI			EN30
#define	EN_PDC_PCERI			EN31
#define	EN_SDHI_CDETI			EN3
#define	EN_SDHI_CACI			EN4
#define	EN_SDHI_SDACI			EN5
#define	EN_MMCIF_CDETIO			EN6
#define	EN_MMCIF_ERRIO			EN7
#define	EN_MMCIF_ACCIO			EN8
#define	EN_POE3_OEI1			EN9
#define	EN_POE3_OEI2			EN10
#define	EN_POE3_OEI3			EN11
#define	EN_POE3_OEI4			EN12
#define	EN_RIIC0_TEI0			EN13
#define	EN_RIIC0_EEI0			EN14
#define	EN_RIIC2_TEI2			EN15
#define	EN_RIIC2_EEI2			EN16
#define	EN_SSIE0_SSIF0			EN17
#define	EN_SSIE1_SSIF1			EN18
#define	EN_S12AD_S12CMPAI		EN20
#define	EN_S12AD_S12CMPBI		EN21
#define	EN_S12AD1_S12CMPAI1		EN22
#define	EN_S12AD1_S12CMPBI1		EN23
#define	EN_RIIC1_TEI1			EN28
#define	EN_RIIC1_EEI1			EN29
#define	EN_DSMIF0_OCDI0			EN1
#define	EN_DSMIF0_SUMEI0		EN2
#define	EN_DSMIF0_SCDI0			EN3
#define	EN_DSMIF1_OCDI1			EN4
#define	EN_DSMIF1_SUMEI1		EN5
#define	EN_DSMIF1_SCDI1			EN6
#define	EN_POEG_POEGGAI			EN7
#define	EN_POEG_POEGGBI			EN8
#define	EN_POEG_POEGGCI			EN9
#define	EN_POEG_POEGGDI			EN10
#define	EN_SCI8_TEI8			EN0
#define	EN_SCI8_ERI8			EN1
#define	EN_SCI9_TEI9			EN4
#define	EN_SCI9_ERI9			EN5
#define	EN_SCI10_TEI10			EN8
#define	EN_SCI10_ERI10			EN9
#define	EN_SCI11_TEI11			EN12
#define	EN_SCI11_ERI11			EN13
#define	EN_RSPI0_SPII0			EN16
#define	EN_RSPI0_SPEI0			EN17
#define	EN_RSPI1_SPII1			EN18
#define	EN_RSPI1_SPEI1			EN19
#define	EN_RSPI2_SPII2			EN20
#define	EN_RSPI2_SPEI2			EN21
#define	EN_SCI7_TEI7			EN22
#define	EN_SCI7_ERI7			EN23
#define	EN_EPTPC_MINT			EN0
#define	EN_PTPEDMAC_PINT		EN1
#define	EN_EDMAC0_EINT0			EN4
#define	EN_EDMAC1_EINT1			EN5
#define	EN_GLCDC_VPOS			EN8
#define	EN_GLCDC_GR1UF			EN9
#define	EN_GLCDC_GR2UF			EN10
#define	EN_DRW2D_DRWIRQ			EN11
#define	EN_ESC_ESCI				EN13

#define	CLR_DPFPU_DPFPUEX		CLR0
#define	CLR_CAN0_ERS0			CLR0
#define	CLR_CAN1_ERS1			CLR1
#define	CLR_CAN2_ERS2			CLR2

